# BuiltInFailures.SiteImportFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SiteImportFailures Class
BuiltInFailures Class Members See Also
---
Failures about SiteImport.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class SiteImportFailures
```

Visual Basic
---
```text
Public NotInheritable Class SiteImportFailures
```

Visual C++
---
```text
public ref class SiteImportFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..SiteImportFailures
# See Also
BuiltInFailures..::..SiteImportFailures Members
Autodesk.Revit.DB Namespace